_posts/2018-10-01-MyVocabs.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgbdca0fc">1. A</a></li>
<li><a href="#org5f6d8aa">2. B</a></li>
<li><a href="#org5dff1dd">3. C</a></li>
<li><a href="#orgd75cea3">4. D</a></li>
<li><a href="#org39e12ad">5. E</a></li>
<li><a href="#orgce64259">6. F</a></li>
<li><a href="#orgdd234b3">7. G</a></li>
<li><a href="#orga98f251">8. H</a></li>
<li><a href="#org6bdd9b2">9. I</a></li>
<li><a href="#orgabcb3d1">10. J</a></li>
<li><a href="#org1c94b3c">11. K</a></li>
<li><a href="#orgd08f962">12. L</a></li>
<li><a href="#orgab02cd4">13. M</a></li>
<li><a href="#org22c08b4">14. N</a></li>
<li><a href="#org5fb1901">15. O</a></li>
<li><a href="#org80d973b">16. P</a></li>
<li><a href="#org40d4534">17. Q</a></li>
<li><a href="#orgd8523db">18. R</a></li>
<li><a href="#orgcce3e2e">19. S</a></li>
<li><a href="#orgc0ed35b">20. T</a></li>
<li><a href="#orgb7f5e33">21. U</a></li>
<li><a href="#org4624487">22. V</a></li>
<li><a href="#org92617cf">23. W</a></li>
<li><a href="#orgcee44b8">24. X</a></li>
<li><a href="#org20d0d67">25. Y</a></li>
<li><a href="#org4c80e17">26. Z</a></li>
</ul>
</div>
</div>
<div class="HTML">
<p>
&#x2014;
layout: post
title: "Vocabs"
permalink: <i>:title</i>
tags: [Hi Language]
&#x2014;
&lt;head&gt;
   &lt;meta http-equiv="Content-Type" content="text/html;charset=utf-8"&gt;
&lt;/head&gt;
</p>

</div>
<div id="outline-container-orgbdca0fc" class="outline-2">
<h2 id="orgbdca0fc"><span class="section-number-2">1</span> A</h2>
<div class="outline-text-2" id="text-1">
<p>
accountable:
</p>
<ul class="org-ul">
<li>Accountable/responsible to victims/citizens</li>
</ul>

<p>
arduous:
</p>
<ul class="org-ul">
<li>an arduous journey</li>
<li>She comes by way of an arduous journey.</li>
</ul>
</div>
</div>
<div id="outline-container-org5f6d8aa" class="outline-2">
<h2 id="org5f6d8aa"><span class="section-number-2">2</span> B</h2>
</div>

<div id="outline-container-org5dff1dd" class="outline-2">
<h2 id="org5dff1dd"><span class="section-number-2">3</span> C</h2>
<div class="outline-text-2" id="text-3">
<p>
camaraderie:
</p>
<ul class="org-ul">
<li>I appreciate the camaraderie.</li>
<li>a genuine camaraderie on the hockey team</li>
<li>The last few days and nights are a good indication of team spirit and camaraderie among the teams.</li>
</ul>

<p>
condone:
</p>
<ul class="org-ul">
<li>accept and allow (behavior that is considered morally wrong or offensive) to continue</li>
<li>They can't publicly condone piracy.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd75cea3" class="outline-2">
<h2 id="orgd75cea3"><span class="section-number-2">4</span> D</h2>
</div>
<div id="outline-container-org39e12ad" class="outline-2">
<h2 id="org39e12ad"><span class="section-number-2">5</span> E</h2>
</div>
<div id="outline-container-orgce64259" class="outline-2">
<h2 id="orgce64259"><span class="section-number-2">6</span> F</h2>
</div>
<div id="outline-container-orgdd234b3" class="outline-2">
<h2 id="orgdd234b3"><span class="section-number-2">7</span> G</h2>
</div>
<div id="outline-container-orga98f251" class="outline-2">
<h2 id="orga98f251"><span class="section-number-2">8</span> H</h2>
</div>
<div id="outline-container-org6bdd9b2" class="outline-2">
<h2 id="org6bdd9b2"><span class="section-number-2">9</span> I</h2>
<div class="outline-text-2" id="text-9">
<p>
implication
</p>
<ul class="org-ul">
<li>suggest something without saying it directly</li>
<li>the action or state of being involved in something.</li>
</ul>
</div>
</div>
<div id="outline-container-orgabcb3d1" class="outline-2">
<h2 id="orgabcb3d1"><span class="section-number-2">10</span> J</h2>
</div>
<div id="outline-container-org1c94b3c" class="outline-2">
<h2 id="org1c94b3c"><span class="section-number-2">11</span> K</h2>
</div>
<div id="outline-container-orgd08f962" class="outline-2">
<h2 id="orgd08f962"><span class="section-number-2">12</span> L</h2>
<div class="outline-text-2" id="text-12">
<p>
legitimate
</p>
<ul class="org-ul">
<li>allowed by law</li>
<li>a legitimate job</li>
</ul>
</div>
</div>
<div id="outline-container-orgab02cd4" class="outline-2">
<h2 id="orgab02cd4"><span class="section-number-2">13</span> M</h2>
</div>
<div id="outline-container-org22c08b4" class="outline-2">
<h2 id="org22c08b4"><span class="section-number-2">14</span> N</h2>
</div>
<div id="outline-container-org5fb1901" class="outline-2">
<h2 id="org5fb1901"><span class="section-number-2">15</span> O</h2>
</div>
<div id="outline-container-org80d973b" class="outline-2">
<h2 id="org80d973b"><span class="section-number-2">16</span> P</h2>
<div class="outline-text-2" id="text-16">
<p>
piracy:
</p>
<ul class="org-ul">
<li>the practice of attacking and robbing ships at sea.</li>
<li>the practive of illegally copying a computer program, music, a film, etc.</li>
<li>Fighting piracy is likely to be a longand drawn put battle.</li>
</ul>


<p>
predecessor:
</p>
<ul class="org-ul">
<li>a person who held a job or office before the current holder</li>
<li>My administration is different from my predecessor.</li>
</ul>
</div>
</div>
<div id="outline-container-org40d4534" class="outline-2">
<h2 id="org40d4534"><span class="section-number-2">17</span> Q</h2>
</div>
<div id="outline-container-orgd8523db" class="outline-2">
<h2 id="orgd8523db"><span class="section-number-2">18</span> R</h2>
</div>
<div id="outline-container-orgcce3e2e" class="outline-2">
<h2 id="orgcce3e2e"><span class="section-number-2">19</span> S</h2>
<div class="outline-text-2" id="text-19">
<p>
shareware
</p>
</div>
</div>
<div id="outline-container-orgc0ed35b" class="outline-2">
<h2 id="orgc0ed35b"><span class="section-number-2">20</span> T</h2>
</div>
<div id="outline-container-orgb7f5e33" class="outline-2">
<h2 id="orgb7f5e33"><span class="section-number-2">21</span> U</h2>
</div>
<div id="outline-container-org4624487" class="outline-2">
<h2 id="org4624487"><span class="section-number-2">22</span> V</h2>
</div>
<div id="outline-container-org92617cf" class="outline-2">
<h2 id="org92617cf"><span class="section-number-2">23</span> W</h2>
</div>
<div id="outline-container-orgcee44b8" class="outline-2">
<h2 id="orgcee44b8"><span class="section-number-2">24</span> X</h2>
</div>
<div id="outline-container-org20d0d67" class="outline-2">
<h2 id="org20d0d67"><span class="section-number-2">25</span> Y</h2>
</div>
<div id="outline-container-org4c80e17" class="outline-2">
<h2 id="org4c80e17"><span class="section-number-2">26</span> Z</h2>
</div>
